<?php

namespace Common\Permissions\Common;

class Code
{

    private static $_zhCode; //中文代码
    private static $_enCode; //英文代码
    private static $_attr;

    /*
    * 获取错误信息
    * @param integer $code 状态码
    * @param string $lang 语言
    * return string
    */
    public static function code($code, $lang=null, $attr='')
    {
        self::$_attr = $attr;
        self::$_zhCode = self::zh_code();
        self::$_enCode = self::en_code();
        switch ($lang) {
            case 'zh':
                return self::$_zhCode[$code];
                break;
            case 'en':
                return self::$_enCode[$code];
                break;
            default:
                return self::$_zhCode[$code];
        }
    }

    /**
     * 获取错误码的信息文档
     * return array
     */
    public static function document()
    {
        self::$_attr = '$attr';
        return self::zh_code();
    }


    /*
    * 获取中文(zh)错误信息
    * @param integer $code 状态码
    * return string
    */
    public static function zh_code()
    {
        return array(

            /**
             * 系统级别
             */
            // 签名校验 #10000~10020#
            200 => '请求成功',
            401 => '未登录',
            403 => '没权限',
            500 => '系统错误，请联系管理员',
            10001 => '系统错误',
            10002 => '缺少必要的校验参数',
            10003 => '必要校验参数格式错误',
            10004 => '签名不存在,该用户未登录',
            10005 => '签名已过期',
            10006 => '签名校验失败',
            10007 => '非法的请求域',
            10008 => '非法请求',

            // 系统保护 #10020~10040#
            10020 => '系统维护',
            10021 => '远程服务器错误',
            10022 => 'IP限制不能请求资源',
            10023 => '应用接口访问权限受限',
            10024 => '任务过多,系统繁忙',
            10025 => '用户请求频次上限',
            10026 => '任务超时',
            10027 => '接口已停用',

            // 数据判断 #10040~10060#
            10040 => '接口不存在',
            10041 => '数据处理未知错误',
            10042 => '版本不存在,请升级新版或联系管理员',
            10043 => '您的账号在其他设备登录,您被迫下线,如非本人操作请及时修改密码',

            // 功能维护 #10060~10080#
            10060 => '功能维护,请升级新版或联系管理员',

            // 验证用户操作 #10080~10100#
            10080 => '对不起，您没有该操作权限',


            /**
             * 具体错误代码
             */
            // 公共错误码 #20000~20100#
            20000 => '参数错误,请参考接口文档',
            20001 => '参数缺失 - ' . self::$_attr,
            20002 => '参数格式错误 - ' . self::$_attr,

            // 用户登录注册 #20100~20200#

            20100 => '微信授权系统失败',
            20101 => '您的账户尚未注册',
            20102 => '您的帐号已被禁用',
            20103 => '您还未获得权限',
            20104 => '该账户不存在',
            20105 => '该链接已经被使用',
            20106 => '验证码错误或已经过期',
            20107 => '验证码发送过于频繁，请稍后再试',
            20108 => '手机号码格式不正确',
            20109 => '邮箱格式不正确',
            20110 => '该邮箱已经存在',
            20111 => '账号或密码错误',
            20112 => '超级管理员不可操作',
            20113 => '该微信已经被注册',
            20114 => '该邮箱没有被注册',
            20115 => '请使用企业邮箱进行操作',
            20116 => '微信绑定失败',
            20117 => '请使用微信开放平台二维码渲染',
            20118 => '该链接已经失效',
            20119 => '该账号的邮箱未激活',
            20120 => '请补充资料',
            20121 => '身份证号码格式错误',
            20122 => '护照号码格式错误',
            20123 => '该手机号码已经存在',
            20124 => '该手机号码没有被注册',
            20125 => '您的账号未激活，请激活后使用',
            20126 => '您所发布的内容里面包含敏感信息',
            20127 => '该账户已经被注销',
            20128 => '未获取到您的位置，请重试',
            20129 => '请在公司办公区域内登录',
            20130 => '用户注册失败',
            20131 => '用户更新失败',
            20132 => '用户数据不一致，请从新登录在操作',
            20133 => '邮箱已存在，请登录',
            20134 => '操作太频繁',
            20135 => '验证码失效，请重新发送',
            20136 => '验证码错误',
            20137 => '密码修改失败',

            // 系统设置 #20200~20300#
            20200 => '无权限删除该用户',
            20201 => '改角色名称已经存在，请更换角色名称',
            20202 => '该账户未激活，无法操作',
            20203 => '该邮箱已经存在，请更换后重试',

            // 上传错误 #20300~20400#
            20300 => '上传素材失败 - ' . self::$_attr,
            20301 => '删除素材失败 - ' . self::$_attr,
            20302 => '当前创意无上传素材',
            20303 => '无文件上传',
            20304 => '无效文件',
            20305 => '无效文件',

            //创意错误 #20400~20500#
            20400 => '上传创意失败',
            20401 => '更新创意失败',
            20402 => '当前创意已删除',
            20403 => '查询创意失败',
            20404 => '添加收藏失败',
            20405 => '该创意已收藏',
            20406 => '该创意已下载',
            20407 => '创意信息校验失败,该创意不存在或暂无数据产生',
            20408 => '创意信息关联失败',
            20409 => '该创意已取消收藏',
            20410 => '该素材无法认领',

            //产品错误 #20500~20600#
            20500 => '查询产品失败',

            //行业错误 #20600~20700#
            20600 => '行业数据获取失败',

            //订单错误 #20700~20800#
            20700 => '订单撤销失败',
            20701 => '订单分配失败',
            20702 => '脚本上传失败',
            20703 => '脚本分配失败',
            20704 => '脚本领取失败',
            20705 => '视频素材上传失败',
            20706 => '平面素材上传失败',
            20707 => '订单审核失败',
            20708 => '请求延期失败',
            20709 => '延期审核失败',
            20710 => '延期详情获取失败',
            20711 => '当前状态获取失败',
            20712 => '状态详情获取失败',
            20713 => '订单详情获取失败',
            20714 => '未查询到订单或订单已被领取',
            20715 => '订单修改失败',
            20716 => '订单领取失败',
            20717 => '转单失败',
            20718 => '当前订单无脚本信息',

            // 消息错误
            20800 => '已读状态更新失败',

            // 素材领取
            20900 => '素材解析错误',
            20901 => '素材存储到本地是出现错误',
            20902 => '素材领取失败',
            20903 => '已认领素材移除失败',

            // 工具箱 21000 ~ 21100
            21000 => '文件重复上传',
            21001 => '文件上传失败',
            21002 => '收藏失败',
            21003 => '已收藏',
            21004 => '已移出收藏',
            21005 => '下载失败',
            21006 => '已移出下载',
            21007 => '版权受限',
            21008 => '删除失败',
            21009 => '标签修改失败',
            21010 => 'Token过期',

            // 通告模块 21100 ~ 21200
            21100 => '通告创建失败',
            21101 => '通告删除失败',
            21102 => '通告修改失败',
            21103 => '存在重复设置',
            21104 => '该通告已存在',
            21105 => '演员排期出现问题',
            21106 => '订单处理失败',
            21107 => '状态处理失败',
            21108 => '同一拍摄每天仅允许预约同一演员两次',
            21109 => '该时段已被创建，请选择其他时段',
            21110 => '通告预排失败',
            21111 => '通告生成失败',
            21112 => '通告修改失败',
            21113 => '该时段已被占用',
            21114 => '该时段不可用',
            21115 => '暂无当日通告',
            21116 => '当日通告已生成',
            21117 => '当日需求未排期，无法生成通告',
            21118 => '当前日期不可操作',
            21119 => '演员审核失败',
            21120 => '当前时间不能打分',
            21121 => '打分失败',
            21122 => '无权限查看',
            21123 => '数据不存在',
            21124 => '临时演员创建失败',
            21125 => '演员状态修改失败',

            // 菜单模块 21200 ~ 21250
            21200 => '菜单添加失败',
            21201 => '菜单更新失败',
            21202 => '菜单删除失败',

            // 角色模块 21250 ~ 21300
            21250 => '角色添加失败',
            21251 => '角色更新失败',
            21252 => '角色删除失败',
            21253 => '角色菜单添加失败',
            21254 => '角色功能添加失败',
            21255 => '角色菜单删除失败',
            21256 => '角色功能删除失败',
            21257 => '角色数据不存在',
            21257 => '角色状态修改失败',

            // 题库模块 21300 ~ 21350
            21300 => '题库创建失败',
            21301 => '题库更新失败',
            21302 => '任务创建失败',
            21303 => '任务更新失败',
            21304 => '已发布不能修改',
            21305 => '批量任务创建失败',
            21306 => '有角色没有关联上，请联系管理员',

            40000=>'头条接口错误'
        );
    }



    /*
    * 获取英文(en)错误信息
    * @param integer $code 状态码
    * return string
    */
    public static function en_code()
    {
        return array(

            /**
         * 系统级别
         */


            /**
         * 具体错误级别
         */

        );
    }
}
